src/ex_Tabakon/DataProcessors/ЗакрытиеКассовойСмены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ЗакрытиеКассовойСмены</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/ex_Tabakon/Enums/СтатусыЧековККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыЧековККМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Пробитый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Архивный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отложенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Аннулированный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ex_Tabakon/Enums/ХозяйственныеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХозяйственныеОперации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СдачаДенежныхСредствВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыдачаДенежныхСредствВДругуюОрганизацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыдачаДенежныхСредствВДругуюКассу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыдачаДенежныхСредствВКассуККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПрочиеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПрочиеДоходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыдачаДенежныхСредствИзКассыККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеДенежныхСредствИзКассыККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеОплатыОтКлиента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ex_Tabakon/Documents/ПриходныйКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПриходныйКассовыйОрдер</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Приложение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерЧекаККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПробиватьЧекиПоКассеККМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПробитЧек</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СменаЗакрыта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтчетОРозничныхПродажах</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/ex_Tabakon/Documents/ВыемкаДенежныхСредствИзКассыККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВыемкаДенежныхСредствИзКассыККМ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтчетОРозничныхПродажах</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/ex_Tabakon/Catalogs/Кассы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Кассы</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/ex_Tabakon/DataProcessors/ЗакрытиеКассовойСмены/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
&Перед("ОбработатьДокументыККМСервер")
Процедура ТБКОбработатьДокументыККМСервер(Отказ, СсылкаНаОтчет, НужноДополнительноеПредупреждение)
	//Вик 2021-10-21
	НачатьТранзакцию();
	Если не Отказ тогда
		Запрос	=	Новый Запрос("ВЫБРАТЬ
		      	 	             |	ЧекККМ.Ссылка КАК Ссылка
		      	 	             |ИЗ
		      	 	             |	Документ.ЧекККМ КАК ЧекККМ
		      	 	             |ГДЕ
		      	 	             |	ЧекККМ.Дата >= &Дата
		      	 	             |	И ЧекККМ.СтатусЧекаККМ = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Аннулированный)
		      	 	             |	И ЧекККМ.Комментарий ПОДОБНО &Комментарий
		      	 	             |	И ЧекККМ.Проведен");
		Запрос.УстановитьПараметр("Дата",ТекущаяДата() - 2*24*60*60); //без даты запрос будет очень долго выполняться
		Запрос.УстановитьПараметр("Комментарий","Чек н.ф."); 		
		Рез = Запрос.Выполнить().Выгрузить();
		Если Рез.Количество() = 0 тогда 
			ЗафиксироватьТранзакцию();
			Возврат 
		КонецЕсли;
		
		КопияТовары	=	Новый ТаблицаЗначений;
		КопияТовары.Колонки.Добавить("Количество");
		КопияТовары.Колонки.Добавить("КоличествоУпаковок");
		КопияТовары.Колонки.Добавить("Номенклатура");
		КопияТовары.Колонки.Добавить("Характеристика");
		КопияТовары.Колонки.Добавить("Сумма");
		КопияТовары.Колонки.Добавить("Цена");
	
		Для каждого Строка из Рез цикл
			Об							=	Строка.Ссылка.ПолучитьОбъект();
			Об.Комментарий				=	"Добавлен в ООРП";
			Об.ОбменДанными.Загрузка	=	Истина; //т.к. чек архивный

			Попытка
				Об.Записать();
			Исключение
				Отказ = Истина;
				Сообщить(ОписаниеОшибки());
				Возврат;
			КонецПопытки;
			 
			 Для каждого СтрокаТовары из Об.товары цикл
			 	НоваяСтрока	=	КопияТовары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТовары);
			КонецЦикла;		
		КонецЦикла;
		КопияТовары.Свернуть("Номенклатура, Характеристика, Цена", "Количество, КоличествоУпаковок, Сумма");
		
		//Создаем ООРП
		ОтчетОРозничныхПродажах = СоздатьОтчетОРозничныхПродажах();
		ОтчетОРозничныхПродажах.Комментарий	=	"ООРП не ф.";
		ОтчетОРозничныхПродажах.Дата		=	ТекущаяДата();
		
		СуммаИтого	=	0;
		Для каждого СТрока из КопияТовары цикл
			НоваяСтрока =  ОтчетОРозничныхПродажах.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СТрока);
			
			НоваяСтрока.Склад	=	ОтчетОРозничныхПродажах.Магазин.СкладПродажи;
							
			СуммаИтого = СуммаИтого + СТрока.Сумма;
		КонецЦикла;
		ОтчетОРозничныхПродажах.СуммаОплатыНаличных = СуммаИтого;
		
		Попытка
			ОтчетОРозничныхПродажах.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Отказ = Истина;
			Сообщить(ОписаниеОшибки());
			Возврат;
		КонецПопытки;
		
		//Создаем приходник
		док 				= Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();
		док.кассаККМ 		= ОтчетОРозничныхПродажах.кассаККМ;
		док.Касса	 		= ПолучитьКассу(док.кассаККМ);
		док.Организация 	= док.Касса.Владелец;
		док.СуммаДокумента 	= СуммаИтого;
		док.Дата 			= ТекущаяДата();
		
		док.Комментарий 	= "ПКО не ф.";;
		док.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзКассыККМ;
		
		Запрос	=	Новый запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		      	 	             |	ВыемкаДенежныхСредствИзКассыККМ.Ссылка КАК Ссылка
		      	 	             |ИЗ
		      	 	             |	Документ.ВыемкаДенежныхСредствИзКассыККМ КАК ВыемкаДенежныхСредствИзКассыККМ");
		Рез = Запрос.Выполнить().Выгрузить();
		флТолькоЗапись	=	Ложь;
		Если Рез.Количество() = 1 тогда		
			док.ДокументОснование = Рез[0].Ссылка;
		иначе
			флТолькоЗапись	=	истина;
		КонецЕсли;
		
		док.Приложение	=	"1.1 Торговая розничная выручка - НАЛ";
			
		стр = док.РасшифровкаПлатежа.Добавить();
		стр.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Прочие доходы");
		стр.Сумма = СуммаИтого;
		
		Попытка
			Если флТолькоЗапись тогда
				док.Записать(РежимЗаписиДокумента.Запись);
			иначе
				док.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		Исключение
			Отказ = Истина;
			Сообщить(ОписаниеОшибки());
			Возврат;
		КонецПопытки; 
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	//КонецВик
КонецПроцедуры


Функция ПолучитьКассу(кассаККМ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Кассы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Кассы КАК Кассы
	               |ГДЕ
	               |	Кассы.КассаККМ = &КассаККМ";
	
	
	Запрос.УстановитьПараметр("КассаККМ",кассаККМ);
	рез = Запрос.Выполнить().Выбрать();
	Если рез.Следующий() Тогда
		Возврат рез.Ссылка;
	КонецЕсли;
КонецФУнкции
